//Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.
//5 -> 2, 4
//8 -> 2, 4, 6, 8

Console.Write("enter the number");
int number = Convert.ToInt32(Console.ReadLine());

        if (number > 1)
    {
      int EvenNumber = 0;
    while (EvenNumber <= number);
    }
        Console.Write(EvenNumber  + " " );
        EvenNumbers = EvenNumber + 2;

